{
  "projects": [
    {
      "title": "GAME: GrAspable Media Entertainment",
      "description": "This research explores the development of a Tangible User Interface (TUI) designed for gaming purposes. GAME (GrAspable Media Entertainment) is an innovative project that enables users to physically interact with digital gaming elements, bridging the gap between the physical and virtual worlds. This is achieved through the integration of multiple technologies, including a motion capture system (Optitrack), a short-throw projector (Optoma UHD35STx), and an agent-based simulation software (GAMA). GAME supports interactive gameplay (e.g., Player vs. Player, Player vs. AI), offering a more immersive and versatile gaming experience than conventional screen-based implementations. Furthermore, GAME leverages blockchain technology, specifically the Ripple protocol (i.e., XRPL), to facilitate gameplay actions such as store progress checkpoints, secure in-game transactions, and track player scores. The addition of the blockchain component allows easy game customization, and enhances the overall gaming experience. In conclusion, the combination of tangible user interfaces with blockchain technology can pave the way for future developments in important fields such as education, training, and entertainment where novel interaction methods are paramount.",
      "technologies": ["ROS", "GAMA", "Python", "Bash"],
      "tags": ["TUI", "Research", "Robotics", "Blockchain", "HCI", "OS"],
      "demoLink": "",
      "codeLink": "https://github.com/IERoboticsAILab/GAME",
      "image": "/projects/GAME.gif",
      "images": [
        "/projects/system.png",
        "/projects/system2.png",
        "/projects/umh.png"
      ],
      "videos": [
        "/projects/game1.mp4",
        "/projects/game2.mp4"
      ],
      "pdfLink": "/projects/GAME__GrAspable_Median_Entertainment_Abstract_.pdf"
    },
    {
      "title": "Reinforcement Learning in Cryptocurrency Trading: An Investigation of Effective Strategies",
      "description": "This research paper explores the application of Deep Reinforcement Learning (DRL) to cryptocurrency trading, seeking to evaluate its effectiveness compared to traditional machine learning and algorithmic trading techniques. The study centers on the volatile cryptocurrency markets and the advanced capabilities of machine learning technologies, offering a comprehensive comparison of different trading strategies. Specifically, the focus is on understanding how DRL can enhance trading algorithms to better adapt and perform in the dynamically changing and often unpredictable market environments characteristic of cryptocurrency trading. This investigation leverages theoretical frameworks and simulation models rather than methodical implementations, focusing on conceptual advancements and theoretical validation of DRL strategies fine-tuned to the high-stakes cryptocurrency financial sector.",
      "technologies": ["Python", "TensorFlow", "Pandas", "PyTorch"],
      "tags": ["AI", "Reinforcement Learning", "Data Science", "Blockchain", "Research"],
      "image": "/projects/capstone.png",
      "pdfLink": "/projects/capstone.pdf"
    },
    {
      "title": "Insurance Automation",
      "description": "Computer vision model to extract data from hand-filled car insurance forms and developed a dashboard for generating reports.",
      "technologies": ["Python", "OpenCV", "Pandas"],
      "tags": ["AI", "Computer Vision", "Machine Learning", "Transformers", "Applications", "Web"],
      "pdfLink": "/projects/insurance.pdf",
      "codeLink": "https://github.com/paches00/insurance-automation",
      "image": "/projects/insurance.png",
      "images": [
        "/projects/insurance2.png",
        "/projects/insurance1.png",
        "/projects/insurance3.png"
      ]
    },
    {
      "title": "Bookworms",
      "description": "Advanced book recommender system that provides personalized book recommendations based on the user's reading history and preferences. The system will use a dataset of books and their corresponding reviews from Good Books to generate recommendations for users.",
      "technologies": ["Python", "Pandas", "Transformers", "Flask", "PyTorch", "SciKit-Learn", "Docker", "MongoDB"],
      "tags": ["AI", "Machine Learning", "Data Science", "Web", "Applications", "DevOps", "Research"],
      "codeLink": "https://github.com/thehitchhikersguideto/bookworms",
      "pdfLink": "/projects/reco.pdf",
      "image": "/projects/books.png"
    },
    {
      "title": "ROSBot Autonomous System",
      "description": "",
      "technologies": [],
      "tags": ["Empty"]
    },
    {
      "title": "OptiTrack ROS Communication",
      "description": "ROS package that allows for data communication between OptiTrack System (Motive software), ROS, and UDP",
      "technologies": ["ROS", "Bash", "Linux"],
      "tags": ["Robotics", "OS", "Networking", "Tools", "Research"],
      "codeLink": "https://github.com/IERoboticsAILab/optitrack_ros_communication",
      "image": "/projects/optitrack.png"
    },
    {
      "title": "Line-following Robot",
      "description": "First place in competition line-following robot built with an arduino, bread board, light sensors, and basic hardware.",
      "technologies": ["Arduino", "Circuits", "C#"],
      "tags": ["Robotics", "Electronics", "Hardware"],
      "pdfLink": "/projects/line.pdf",
      "image": "/projects/line.gif",
      "images": [
        "/projects/line1.png",
        "/projects/line2.png"
      ],
      "videos": [
          "/projects/line.mp4"
      ]
    },
    {
      "title": "IE Robotics & AI Lab Network/System Configuration",
      "description": "",
      "technologies": [],
      "tags": ["Tools"],
      "image": "",
      "images": [

      ]
    },
    {
      "title": "LDAP/NFS Configuration",
      "description": "Scripts for configuring LDAP and NFS on Unix clients, downloading required packages, configuring client network, and more functionality created for IE University Robotics & AI Lab infrastructure.",
      "technologies": ["Bash", "Linux"],
      "tags": ["Networking", "OS", "Scripting", "System Administration", "Tools"],
      "codeLink": "https://github.com/IERoboticsAILab/scripts",
      "image": "/projects/ldap.png"
    },
    {
      "title": "Football Team  Database",
      "description": "Full database design and implementation for a football team with backend, frontend, and deployment for management.",
      "technologies": ["HTML", "PHP", "SQL"],
      "tags": ["Web", "Applications"],
      "codeLink": "https://github.com/paches00/Football-Team-Database",
      "image": "/projects/football1.png",
      "images": [
        "/projects/football1.png"
      ],
      "videos": [
        "/projects/football.mp4"
      ]
    }
  ]
}
